_posts/2017-09-12-emacs-tip.html
---
date: 2017-09-12
tags: 
- emacs
author: hijam
layout: post
title: emacs tip
excerpt: emacs tip
categories: 
- emacs
---
<ol class="org-ol">
<li>Using org-mode to write about computer programming <a href="http://clubctrl.com/org/prog/source.html">http://clubctrl.com/org/prog/source.html</a></li>
<li><p>
How to install emacs snapshot on Ubuntu <a href="https://askubuntu.com/questions/297170/how-to-install-emacs-24-3-on-ubuntu">https://askubuntu.com/questions/297170/how-to-install-emacs-24-3-on-ubuntu</a>
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo apt-add-repository ppa:ubuntu-elisp/ppa
sudo apt-get update
sudo apt-get install emacs-snapshot emacs-snapshot-el
</pre>
</div></li>
<li><p>
How to fix emacs segmentation fault error in elementary os
edit emacs.desktop file
</p>
<div class="org-src-container">
<pre class="src src-shell">Exec=env XLIB_SKIP_ARGB_VISUALS=1 emacs %F
</pre>
</div></li>
</ol>
